content-org/_index.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: /

#+title: peregrinator's sourcehut site


This is a /static/ website and is intended to (eventually) be the home
for my blog, Emacs configuration and work updates. I've called it my
/sourcehut/ site because I hope to eventually move to or host it
there. This website uses [[https://github.com/LukasJoswiak/etch][etch]] with [[https://gohugo.io][Hugo]] for the styling, and
everything you see here was written in [[https:orgmode.org][org-mode]], exported to markdown
using [[https://github.com/kaushalmodi/ox-hugo][ox-hugo]] for better compatibility with Hugo - the default [[https://github.com/niklasfasching/go-org][go-org]]
parser doesn't appear to support org-mode syntax in its entirety.

* [[file:emacs/][Emacs]]

You can find a rendered copy of my [[file:emacs/emacs-literate-config][literate configuration]] for Emacs
here.

* [[file:posts][Blog]]

I will be moving some of my older blog articles to the [[file:posts][blog]] here. This
is WIP.
