content/_index.md
+++
title = "peregrinator's sourcehut site"
author = ["Brihadeesh S (They/Them)"]
draft = false
+++

This is a _static_ website and is intended to (eventually) be the home
for my blog, Emacs configuration and work updates. I've called it my
_sourcehut_ site because I hope to eventually move to or host it
there. This website uses [etch](https://github.com/LukasJoswiak/etch) with [Hugo](https://gohugo.io) for the styling, and
everything you see here was written in [org-mode](https:orgmode.org), exported to markdown
using [ox-hugo](https://github.com/kaushalmodi/ox-hugo) for better compatibility with Hugo - the default [go-org](https://github.com/niklasfasching/go-org)
parser doesn't appear to support org-mode syntax in its entirety.


## [Emacs](emacs/) {#emacs--emacs}

You can find a rendered copy of my [literate configuration](emacs/emacs-literate-config) for Emacs
here.


## [Blog](posts) {#blog--posts}

I will be moving some of my older blog articles to the [blog](posts) here. This
is WIP.
